EDT/УТ/src/Documents/ПереносЗаказовРегламент/ПереносЗаказовРегламент.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПереносЗаказовРегламент</name>
  <registerRecords>InformationRegister.СостоянияЗаказов</registerRecords>
  <registerRecords>InformationRegister.ДатыДоставок</registerRecords>
  <attributes>
    <name>ДатаПереноса</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаПереноса</name>
    <type>
      <types>CatalogRef.ПричиныОтказаПереноса</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Контрагенты</name>
    <attributes>
      <name>СхемаЛимитирования</name>
      <type>
        <types>CatalogRef.СхемаЛимитированияКоличестваЗаказов</types>
      </type>
    </attributes>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Лимит</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПеренесенныеЗаказы</name>
    <attributes>
      <name>Заказ</name>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
    <attributes>
      <name>ИсходнаяДата</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

EDT/УТ/src/InformationRegisters/СостоянияЗаказов/СостоянияЗаказов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СостоянияЗаказов</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>РезультатДоставки</name>
    <type>
      <types>CatalogRef.новаРезультатМестнойДоставки</types>
    </type>
  </resources>
  <resources>
    <name>ПричинаНеВыполнения</name>
    <type>
      <types>CatalogRef.ПричиныНеВыполненияДоставки</types>
    </type>
  </resources>
  <resources>
    <name>ПричинаОтказа</name>
    <type>
      <types>CatalogRef.ПричиныОтказаПереноса</types>
    </type>
  </resources>
  <resources>
    <name>ДатаПереноса</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>Экспедитор_КУдалению</name>
    <type>
      <types>CatalogRef.новаЭкспедиторы</types>
    </type>
  </resources>
  <resources>
    <name>Водитель_КУдалению</name>
    <type>
      <types>CatalogRef.новаВодители</types>
    </type>
  </resources>
  <resources>
    <name>СторонаПретензий</name>
    <type>
      <types>EnumRef.СторонаПретензий</types>
    </type>
  </resources>
  <resources>
    <name>Инициатор</name>
    <type>
      <types>EnumRef.ИнициаторыСостояния</types>
    </type>
  </resources>
  <resources>
    <name>Рейс</name>
    <type>
      <types>DocumentRef.Рейс</types>
    </type>
  </resources>
  <resources>
    <name>ДатаДоставки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Доставка</name>
    <type>
      <types>BusinessProcessRef.новаМестнаяДоставка</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/InformationRegisters/ДатыДоставок/ДатыДоставок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДатыДоставок</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ДатаДоставки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаДоставкиСтарая</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Доставка</name>
    <type>
      <types>BusinessProcessRef.новаМестнаяДоставка</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПричинаИзмененияДаты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ПричинаИзмененияДатыСпр</name>
    <type>
      <types>EnumRef.ПричиныИзмененияДатыДоставки</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/InformationRegisters/РассылкиКонтрагентов/РассылкиКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РассылкиКонтрагентов</name>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипРассылки</name>
    <type>
      <types>EnumRef.ТипыРассылки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Почта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Активна</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/Enums/ПричиныИзмененияДатыДоставки/ПричиныИзмененияДатыДоставки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ПричиныИзмененияДатыДоставки</name>
  <enumValues>
    <name>ВыгрузкаИзАдминки</name>
  </enumValues>
  <enumValues>
    <name>НеПривезлиСоСклада</name>
  </enumValues>
  <enumValues>
    <name>ПереносВСвязиСПревышениемЛимита</name>
  </enumValues>
  <enumValues>
    <name>ВыгрузкаИзСистемыАксиомус</name>
  </enumValues>
  <enumValues>
    <name>ГрупповаяОбработка</name>
  </enumValues>
  <enumValues>
    <name>ОприходованиеЗаказаСоСдвигомДатыДоставки</name>
  </enumValues>
  <enumValues>
    <name>СдвигДатыОтклоненногоЗаказаПриЕгоПоступлении</name>
  </enumValues>
  <enumValues>
    <name>ВыполнениеЗаказаСПеренесеннойДатойДоставки</name>
  </enumValues>
  <enumValues>
    <name>ПереносДатыДоставкиПриОтменеЗаказа</name>
  </enumValues>
  <enumValues>
    <name>ПереносДатыДоставкиЗаказаПоДаннымКалендаряДоставкиЗоны_СозданиеЗаказа</name>
  </enumValues>
  <enumValues>
    <name>ПереносДатыДоставкиЗаказаПоДаннымКалендаряДоставкиЗоны_ПоступлениеНаСклад</name>
  </enumValues>
</mdclass:Enum>

EDT/УТ/src/Enums/ТипыРассылки/ТипыРассылки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыРассылки</name>
  <enumValues>
    <name>АдминистративнаяРассылка</name>
  </enumValues>
  <enumValues>
    <name>БухгалтерскаяРассылка</name>
  </enumValues>
  <enumValues>
    <name>ТехническаяРассылка</name>
  </enumValues>
  <enumValues>
    <name>СкладскаяРассылка</name>
  </enumValues>
  <enumValues>
    <name>ЛогистическаяРассылка</name>
  </enumValues>
  <enumValues>
    <name>ФинансоваяРассылка</name>
  </enumValues>
  <enumValues>
    <name>ЗагрузкаЗаказов</name>
  </enumValues>
  <enumValues>
    <name>ЗагрузкаАктовПриемаПередачи</name>
  </enumValues>
  <enumValues>
    <name>ЗаборнаяЛогистика</name>
  </enumValues>
  <enumValues>
    <name>КонтрольЗаказов</name>
  </enumValues>
</mdclass:Enum>

EDT/УТ/src/Catalogs/ПричиныНеВыполненияДоставки/ПричиныНеВыполненияДоставки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПричиныНеВыполненияДоставки</name>
  <predefined>
    <items>
      <name>НеДоставлен</name>
      <description>Не доставлен</description>
    </items>
    <items>
      <name>НетНаСкладе</name>
      <description>Нет на складе</description>
    </items>
    <items>
      <name>ОтказКлиентаБезЗаезда</name>
      <description>Отказ клиента без заезда</description>
    </items>
    <items>
      <name>ОтказКлиентаСЗаездом</name>
      <description>Отказ клиента с заездом</description>
    </items>
    <items>
      <name>ПереносДоставки</name>
      <description>Перенос доставки</description>
    </items>
    <items>
      <name>ПереносНаВторуюОчередь</name>
      <description>Перенос на вторую очередь (без заезда)</description>
    </items>
    <items>
      <name>ПереносСЗаездом</name>
      <description>Перенос с заездом</description>
    </items>
  </predefined>
  <attributes>
    <name>Перенос</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапретВыбораВМобильномПриложении</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Доставка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Забор</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Заезд</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КодАдминки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТребоватьВводПричиныОтказаПереноса</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Отмена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

EDT/УТ/src/Documents/ПереносЗаказовРегламент/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	// Вставить содержимое обработчика.
	Попытка
		ПодключениеКМагазину = Евген.СоздатьПодключениеКИнтернетМагазину(); 
	Исключение
		НормальныйХодВыполнения = Ложь;
		Возврат;
	КонецПопытки;
	
	
	Движения.СостоянияЗаказов.Очистить();
	Движения.СостоянияЗаказов.Записывать = Истина;

	
	Движения.ДатыДоставок.Очистить();
	Движения.ДатыДоставок.Записывать = Истина;
	
	СтрокаП = 	"Уважаемые партнеры
				|Заказы ниже были перенесены на " + Формат(ДатаПереноса, "ДЛФ=DD") + ", т.к. превысили допустимый лимит доставок в день
				|Просим Вас не отгружать заказы " + Формат(Дата, "ДЛФ=DD") + " и проинформировать клиентов об изменении даты доставки:" + Символы.пс;
	
	// Вставить содержимое обработчика.
	
	//Логистическая, Складская
	
	Для Каждого ТекК Из Контрагенты Цикл
		Струк = Новый Структура;
		Струк.Вставить("Контрагент", ТекК.Контрагент);
		Най = ПеренесенныеЗаказы.НайтиСтроки(Струк);
		
		СтрокаП = 	"Уважаемые партнеры
		|Заказы ниже были перенесены на " + Формат(ДатаПереноса, "ДЛФ=DD") + ", т.к. превысили допустимый лимит доставок в день
		|Просим Вас не отгружать заказы " + Формат(Дата, "ДЛФ=DD") + " и проинформировать клиентов об изменении даты доставки:" + Символы.пс;
		
		Для Сч = 0 По Най.Количество() - 1 Цикл
			
			Тек = Най[Сч];
			СтрокаП = СтрокаП + СокрЛП(Тек.заказ.Номер) + "/" + СокрЛП(Тек.заказ.НомерВнешнегоЗаказа) + "," + Символы.ПС;
			
			Д = БизнесПроцессы.новаМестнаяДоставка.НайтиПоНомеру(Тек.заказ.Номер).ПолучитьОбъект();
			
			Д.Дата = ДатаПереноса;
			
			ЧН = Час(Д.ВремяОтправленияС);
			ЧК = Час(Д.ВремяОтправленияПо);
			
			МН = Минута(Д.ВремяОтправленияС);
			МК = Минута(Д.ВремяОтправленияПо);
			
			ЧН_ = Час(Д.ВремяПрибытияС);
			ЧК_ = Час(Д.ВремяПрибытияПо);
			
			МН_ = Минута(Д.ВремяПрибытияС);
			МК_ = Минута(Д.ВремяПрибытияПо);
			
			
			Д.ВремяОтправленияС = Дата(Формат(Год(ДатаПереноса), "ЧГ=") + Формат(Месяц(ДатаПереноса), "ЧЦ=2; ЧВН=; ЧГ=") + Формат(День(ДатаПереноса), "ЧЦ=2; ЧВН=; ЧГ=") + Формат(ЧН, "ЧЦ=2; ЧВН=; ЧГ=") + Формат(МН, "ЧЦ=2; ЧВН=; ЧГ=") + "00");
			Д.ВремяОтправленияПо = Дата(Формат(Год(ДатаПереноса), "ЧГ=") + Формат(Месяц(ДатаПереноса), "ЧЦ=2; ЧВН=; ЧГ=") + Формат(День(ДатаПереноса), "ЧЦ=2; ЧВН=; ЧГ=") + Формат(ЧК, "ЧЦ=2; ЧВН=; ЧГ=") + Формат(МК, "ЧЦ=2; ЧВН=; ЧГ=") + "00");
			
			Д.ВремяПрибытияС = Дата(Формат(Год(ДатаПереноса), "ЧГ=") + Формат(Месяц(ДатаПереноса), "ЧЦ=2; ЧВН=; ЧГ=") + Формат(День(ДатаПереноса), "ЧЦ=2; ЧВН=; ЧГ=") + Формат(ЧН_, "ЧЦ=2; ЧВН=; ЧГ=") + Формат(МН_, "ЧЦ=2; ЧВН=; ЧГ=") + "00");
			Д.ВремяПрибытияПо = Дата(Формат(Год(ДатаПереноса), "ЧГ=") + Формат(Месяц(ДатаПереноса), "ЧЦ=2; ЧВН=; ЧГ=") + Формат(День(ДатаПереноса), "ЧЦ=2; ЧВН=; ЧГ=") + Формат(ЧК_, "ЧЦ=2; ЧВН=; ЧГ=") + Формат(МК_, "ЧЦ=2; ЧВН=; ЧГ=") + "00");
			
			Д.Записать();
			
			УстановитьДатуВАдминке(Тек.Заказ.Номер, ДатаПереноса, ПодключениеКМагазину);
			
			
			Док = Тек.Заказ.ПолучитьОбъект();
			Док.Дата = ДатаПереноса;
			Док.Записать(РежимЗаписиДокумента.Запись);
			Если Док.Проведен Тогда
				Док.Записать(РежимЗаписиДокумента.Проведение);
			КонецеСли;
			
			Нов = Движения.СостоянияЗаказов.Добавить();
			Нов.Период = Дата;
			Нов.Доставка = Д.Ссылка;
			Нов.ПричинаНеВыполнения = Справочники.ПричиныНеВыполненияДоставки.ПереносДоставки;
			Нов.ПричинаОтказа = ПричинаПереноса;
			
			Нов = Движения.ДатыДоставок.Добавить();
			Нов.ДатаДоставки = ДатаПереноса;
			Нов.Доставка = Д.Ссылка;
			Нов.Период = Дата;
			Нов.ПричинаИзмененияДаты = Перечисления.ПричиныИзмененияДатыДоставки.ПереносВСвязиСПревышениемЛимита;
		
		КонецЦикла;	
		
		если Най.Количество() <> 0 Тогда
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			|	РассылкиКонтрагентов.Почта
			|ИЗ
			|	РегистрСведений.РассылкиКонтрагентов КАК РассылкиКонтрагентов
			|ГДЕ
			|	РассылкиКонтрагентов.Контрагент = &Контрагент
			|	И РассылкиКонтрагентов.ТипРассылки В(&ТипРассылки)";
			МасТип = Новый Массив;
			МасТип.Добавить(Перечисления.ТипыРассылки.СкладскаяРассылка);
			МасТип.Добавить(Перечисления.ТипыРассылки.ЛогистическаяРассылка);
			Запрос.УстановитьПараметр("Контрагент", ТекК.Контрагент);
			Запрос.УстановитьПараметр("ТипРассылки", МасТип);
			Адр = Запрос.Выполнить().Выгрузить();
			
			МасП = Новый Массив;
			Для Каждого Тек Из Адр Цикл
				МасП.Добавить(Тек.Почта);
			КонецЦикла;	
			МасП.Добавить("logist@strizh-logistic.ru");
            //+++++Серегин М.В. 19.01.2016 11:51:47 
            //МасП.Добавить("yuriy.gnedov@strizh-logistic.ru");
            //-----Серегин М.В. 19.01.2016 11:51:48 
			//МасП.Добавить("pavel.nechaev@strizh-logistic.ru");
			//МасП.Добавить("evgeniy.marochkin@strizh-logistic.ru");
			//МасП.Добавить("pavel.nechaev@strizh-logistic.ru");
			
			
			lem.ОтправитьСообщение(МасП, "Перенесенные заказы (" + СокрЛП(ТекК.Контрагент.Наименование) + ") в связи с превышением лимита" ,СтрокаП,,"Логистическая компания ""Стриж""",,,,,МасТип);
		КонецеСли;
	КонецЦикла;
КонецПроцедуры



Процедура УстановитьДатуВАдминке(НомерЗ, ДатаЗ, Подкл) Экспорт
	Ткст = "
	|UPDATE _order
	|SET DeliveryDate = '" + Евген.ДатаВSQL(ДатаЗ, Ложь) + "'
	| WHERE orderId = " + Формат(НомерЗ, "ЧГ=") + "
	|EXEC mp_saveOrderHistory " + Формат(НомерЗ, "ЧГ=");
	Евген.ЗапросКИнтернетМагазину(Ткст, Подкл);
    //
    ////Серегин М.В. 30.07.2015 17:45:41 старый код 
    //Ткст = "
    //|UPDATE _order
    //|SET carid = 0
    //| WHERE orderId = " + Формат(НомерЗ, "ЧГ=") + "
    //|EXEC mp_saveOrderHistory " + Формат(НомерЗ, "ЧГ=");
    //Евген.ЗапросКИнтернетМагазину(Ткст, Подкл);
    ////Серегин М.В. 30.07.2015 17:45:49 новый
    Ткст = "
	|EXEC p1c_removeCarriageFromOrder " + Формат(НомерЗ, "ЧГ=") + "
	|EXEC mp_saveOrderHistory " + Формат(НомерЗ, "ЧГ=");
	Евген.ЗапросКИнтернетМагазину(Ткст, Подкл);
    //Серегин М.В. 30.07.2015 17:45:52 
	
КонецПроцедуры	


Процедура УстановитьСтатусСтрижаВАдминке(НомерЗ) Экспорт
	Попытка
		ПодключениеКМагазину = Евген.СоздатьПодключениеКИнтернетМагазину(); 
	Исключение
		НормальныйХодВыполнения = Ложь;
		Возврат;
	КонецПопытки;
	Ткст = "
	|UPDATE _order
	|SET Status = 2
	| WHERE orderId = " + Формат(НомерЗ, "ЧГ=") + "
	|EXEC mp_saveOrderHistory " + Формат(НомерЗ, "ЧГ=");
	Евген.ЗапросКИнтернетМагазину(Ткст, ПодключениеКМагазину);
КонецПроцедуры
